In [1]:
import pandas as pd

## 예제 1-4 변수에 할당

In [4]:
df = pd.DataFrame([[1,2,3], [4,5,6], [7,8,9]], columns=list('abc'))

In [5]:
df

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [6]:
df_a = df

In [9]:
df_a['a'] = 100

In [10]:
df_a

     a  b  c
0  100  2  3
1  100  5  6
2  100  8  9

In [11]:
id(df),id(df_a)

(1783813065936, 1783813065936)

In [12]:
#is : (A is B) A, B 두 객체의 주소가 같은지 확인, 같으면 Ture 틀리면 False

In [13]:
df.values.base is df_a.values.base

True